DebtManagment/src/DataProcessors/ЗаполнениеАдресов/ЗаполнениеАдресов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗаполнениеАдресов</name>
</mdclass:DataProcessor>

DebtManagment/src/InformationRegisters/АдресныеОбъекты/АдресныеОбъекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АдресныеОбъекты</name>
  <attributes>
    <name>РодительскийИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>МуниципальныйРодительскийИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сокращение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодКЛАДР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеАдресныеСведения</name>
    <comment>Служебный идентификатор комбинации кодов ОКАТО и т.п.</comment>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Уровень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Идентификатор</name>
    <comment>Глобальный уникальный идентификатор адресного объекта ФНС</comment>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодСубъектаРФ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

DebtManagment/src/Catalogs/Должники/Должники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Должники</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусРаботыСДолгом</name>
    <type>
      <types>EnumRef.СтатусыРаботыСДолгом</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДолжника</name>
    <type>
      <types>EnumRef.СтатусыДолжника</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <comment>Идентификационный номер налогоплательщика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СемейноеПоложение</name>
    <type>
      <types>EnumRef.СемейноеПоложение</types>
    </type>
  </attributes>
  <attributes>
    <name>Образование</name>
    <type>
      <types>EnumRef.ВидыОбразования</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеДолжника</name>
    <type>
      <types>EnumRef.СостоянияДолжника</types>
    </type>
  </attributes>
  <attributes>
    <name>ОГРНИП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКАТО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойРасчетныйСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИОГенеральногоДиректора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>CatalogRef.Адреса</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Соцсети</name>
    <attributes>
      <name>АктуальностьКонтакта</name>
      <type>
        <types>EnumRef.АктуальностьКонтакта</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>202</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеСоцСети</name>
      <type>
        <types>CatalogRef.Соцсети</types>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаКонтакт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусКонтакта</name>
      <type>
        <types>EnumRef.СтатусыКонтактаДолжника</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

DebtManagment/src/Catalogs/Адреса/Адреса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Адреса</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Идентификатор</name>
    <comment>Глобальный уникальный идентификатор адресного объекта ФНС</comment>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСубъектаРФ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РодительскийИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>МуниципальныйРодительскийИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Сокращение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодКЛАДР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеАдресныеСведения</name>
    <comment>Служебный идентификатор комбинации кодов ОКАТО и т.п.</comment>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Уровень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

DebtManagment/src/DataProcessors/ЗаполнениеАдресов/Forms/Форма/Module.bsl
&НаСервере
Процедура ЗаполнитьНаСервере()
	// Вставить содержимое обработчика.   
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДолжникиКонтактнаяИнформация.Ссылка КАК Ссылка,
		|	ДолжникиКонтактнаяИнформация.Вид КАК Вид,
		|	ДолжникиКонтактнаяИнформация.Представление КАК Представление,
		|	ДолжникиКонтактнаяИнформация.Значение КАК Значение,
		|	ДолжникиКонтактнаяИнформация.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Справочник.Должники.КонтактнаяИнформация КАК ДолжникиКонтактнаяИнформация
		|ГДЕ
		|	ДолжникиКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес) 
		|  И ДолжникиКонтактнаяИнформация.Адрес= ЗНАЧЕНИЕ(Справочник.Адреса.ПустаяССылка)
		|	И (ВЫРАЗИТЬ(ДолжникиКонтактнаяИнформация.Значение КАК СТРОКА(100))) <> """"";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи  
		Сообщить("========================================================");
		Сообщить("Создаем ищем адрес "+ВыборкаДетальныеЗаписи.Представление);
		КонтактнаяИнформацияJSON=СтрЗаменить(ВыборкаДетальныеЗаписи.Значение,"¶","");
		КонтактнаяИнформация = УправлениеКонтактнойИнформациейСлужебный.JSONВКонтактнуюИнформациюПоПолям(КонтактнаяИнформацияJSON, Перечисления.ТипыКонтактнойИнформации.Адрес);
		// TODO ОПТИМИЗИРОВАТЬ
		СсылкаНаАдрес = СоздатьЗаполнитьАдреса(КонтактнаяИнформация); 
		Если СсылкаНаАдрес<>Неопределено тогда
			СпрДолжникОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			СпрДолжникОбъект.КонтактнаяИнформация[ВыборкаДетальныеЗаписи.НомерСтроки-1].Адрес= СсылкаНаАдрес;
			СпрДолжникОбъект.Записать();  
			Сообщить("Записан объект "+СпрДолжникОбъект.Ссылка);
		КонецЕсли;	
	КонецЦикла;
	

КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры
//возвращает ссылку на Элемент Справочника Адреса
&НаСервере
Функция СоздатьЗаполнитьАдреса(КонтактнаяИнформация)   
	//Нашли дом	
	если ЗначениеЗаполнено(КонтактнаяИнформация.Houseid) тогда
		Сообщить("Houseid заполнен ищем по нему");	
		СсылкаДом=НайтиОбъектПОИдентификатору(КонтактнаяИнформация.Houseid);
		если СсылкаДом<>Неопределено тогда     
			Сообщить("Houseid Найден возвращаем его");
			Возврат СсылкаДом;
		Конецесли;	
	иначеесли Не ЗначениеЗаполнено(КонтактнаяИнформация.houseNumber) тогда
		//
			Сообщить("Houseid не заполнен и нет информации о доме");
			Сообщить("НЕ НАШЛИ");
		Возврат Неопределено;
	КонецЕсли;	
	//Ищем улицу
	если ЗначениеЗаполнено(КонтактнаяИнформация.streetId) тогда
		Сообщить("streetId заполнен ищем по нему");	
		СсылкаУлица=НайтиОбъектПОИдентификатору(КонтактнаяИнформация.streetId);
	    если СсылкаУлица<>Неопределено тогда     
			Сообщить("Улица найдена");
			СсылкаДом =СоздатьВернутьДом(СсылкаУлица,КонтактнаяИнформация.Houseid,КонтактнаяИнформация.houseNumber, КонтактнаяИнформация.HouseType);
			Сообщить("Создан НОВЫЙ ДОМ.");;
			Возврат СсылкаДом;
		иначе
			Сообщить("Улица НЕ найдена. Ищем создаем родительские элементы");
			СсылкаУлица =СоздатьНайтиРодительскиеЭлементы(КонтактнаяИнформация.streetId);
			СоздатьЗаполнитьАдреса(КонтактнаяИнформация);
		Конецесли;
	иначе
		Сообщить("ОШИБКА streetId  НЕ заполнен!!!");		
		Возврат Неопределено;
	КонецЕсли;	
	//Сообщить(КонтактнаяИнформация.Houseid);	 
	Возврат Неопределено;
КонецФункции    

&НаСервере
Функция СоздатьНайтиРодительскиеЭлементы(Идентификатор)
	
	//1 Ищем в ФИАС данные по  Идентификатор
	ДанныеАдреса= НайтДанныеИЗФИАС(Идентификатор);
	Если ДанныеАдреса<>Неопределено тогда
		Сообщить("Ищем данные по родителю в АДРЕСА"+ДанныеАдреса.Наименование); 
		Если ДанныеАдреса.РодительскийИдентификатор= ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор() тогда
		Сообщить("Родительский адрес ВЕРХНЕГО УРОВНЯ");	
		СпрАдрес=СпрСоздатьВернутьАдрес(Справочники.Адреса.ПустаяСсылка(),ДанныеАдреса);
		Возврат СпрАдрес; 

		Конецесли;	
		НайденныйАдрес=НайтиОбъектПОИдентификатору(ДанныеАдреса.РодительскийИдентификатор);
		Если НайденныйАдрес<>Неопределено тогда
				Сообщить("Нашли РОДИТЕЛЯ "+НайденныйАдрес.Наименование);
				СпрАдрес=СпрСоздатьВернутьАдрес(НайденныйАдрес,ДанныеАдреса);
				Возврат СпрАдрес; 
		иначе
			Возврат СоздатьНайтиРодительскиеЭлементы(ДанныеАдреса.РодительскийИдентификатор)	
		КонецЕсли;	
	КонецЕсли;	
	
КонецФункции

&НаСервере
Функция  СпрСоздатьВернутьАдрес(Родитель,ДанныеАдреса)
   СпрАдрес=Справочники.Адреса.СоздатьЭлемент();
   ЗаполнитьЗначенияСвойств( СпрАдрес,ДанныеАдреса);
   СпрАдрес.Родитель = Родитель;
   СпрАдрес.Записать();    
   Сообщить("Создан адрес "+СпрАдрес.Наименование);
   Возврат СпрАдрес.Ссылка;
	
КонецФункции	

&НаСервере
Функция НайтДанныеИЗФИАС(Идентификатор)
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АдресныеОбъекты.Идентификатор КАК Идентификатор,
		|	АдресныеОбъекты.КодСубъектаРФ КАК КодСубъектаРФ,
		|	АдресныеОбъекты.РодительскийИдентификатор КАК РодительскийИдентификатор,
		|	АдресныеОбъекты.МуниципальныйРодительскийИдентификатор КАК МуниципальныйРодительскийИдентификатор,
		|	АдресныеОбъекты.Наименование КАК Наименование,
		|	АдресныеОбъекты.Сокращение КАК Сокращение,
		|	АдресныеОбъекты.КодКЛАДР КАК КодКЛАДР,
		|	АдресныеОбъекты.ДополнительныеАдресныеСведения КАК ДополнительныеАдресныеСведения,
		|	АдресныеОбъекты.Уровень КАК Уровень
		|ИЗ
		|	РегистрСведений.АдресныеОбъекты КАК АдресныеОбъекты
		|ГДЕ
		|	АдресныеОбъекты.Идентификатор = &Идентификатор";
	
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий()тогда
			Сообщить("Нашли объект с идентификатором "+Идентификатор);

		Возврат ВыборкаДетальныеЗаписи;
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЕсли;                         
	//
	Сообщить("Не нашли объект с идентификатором "+Идентификатор);
	Возврат Неопределено
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецФункции	

&НаСервере
Функция СоздатьВернутьДом(Улица,Houseid,houseNumber, HouseType)
	    СпрДом= НайтиДомНаУлицеПоНомеру(Улица,houseNumber) ;
		Если СпрДом<>Неопределено тогда
			Возврат СпрДом;
		КонецЕсли;	

	    СпрДом =Справочники.Адреса.СоздатьЭлемент();
		Если Houseid="" тогда
		СпрДом.Идентификатор = ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор();
	иначе                                                             
		СпрДом.Идентификатор = Новый УникальныйИдентификатор(Houseid);
		КонецЕсли;
		СпрДом.Родитель =Улица;
		СпрДом.РодительскийИдентификатор =Улица.Идентификатор;
		СпрДом.Сокращение =HouseType;
		СпрДом.Наименование =houseNumber;
		СпрДом.Уровень =8;
		СпрДом.КодСубъектаРФ=Улица.КодСубъектаРФ;
		СпрДом.Записать();
		возврат СпрДом.Ссылка;
КонецФункции	

&НаСервере
Функция НайтиДомНаУлицеПоНомеру(Улица,houseNumber) 
	  	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Адреса.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Адреса КАК Адреса
		|ГДЕ
		|	Адреса.Родитель = &Улица
		|	И Адреса.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", houseNumber);
	Запрос.УстановитьПараметр("Улица", Улица);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий()тогда
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		Возврат ВыборкаДетальныеЗаписи.ссылка;
	КонецЕсли;                        
	Возврат Неопределено;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
КонецФункции	

&НаСервере
фУНКЦИЯ НайтиОбъектПОИдентификатору(Идентификатор)
	       	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Адреса.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Адреса КАК Адреса
		|ГДЕ
		|	Адреса.Идентификатор = &Идентификатор";
	
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() тогда
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Конецесли;
	Возврат Неопределено;	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецФункции
